lab1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          176;
        startFace       10846;
    }
    outlet
    {
        type            patch;
        nFaces          176;
        startFace       11022;
    }
    top
    {
        type            wall;
        nFaces          242;
        startFace       11198;
    }
    bottom
    {
        type            wall;
        nFaces          242;
        startFace       11440;
    }
    left
    {
        type            symmetryPlane;
        nFaces          352;
        startFace       11682;
    }
    right
    {
        type            symmetryPlane;
        nFaces          352;
        startFace       12034;
    }
)

// ************************************************************************* //
