lab1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet    
    {
        type            fixedValue;
        value           uniform (0 0 0.01);	
    }
//
    left
    {
	type	      symmetryPlane;
    }
//
    right
    {
	type	      symmetryPlane;
    }
//
    outlet      
    {
        type            zeroGradient;
    }
//
    top      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
//
    bottom      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    
}

// ************************************************************************* //
